perfomance_testing/csv_test_titler.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Titiler_test_plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">3</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">100</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">/Users/victor/Documents/projects/gis_spacial/data/tile_pool.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
        </CSVDataSet>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">titiler.thegrit.earth</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/cog/tiles/${z}/${x}/${y}.png?url=https://stacapi100.thegrit.earth/eodata/cogeo/twende_landhealth/Kenya_twende_tree_250m_cog.tif&amp;colormap=[[[1,3.0204],[255,255,204,255]],[[3.0204,5.0408],[218,240,194,255]],[[5.0408,7.0612],[180,225,185,255]],[[7.0612,9.0816],[164,219,181,255]],[[9.0816,11.102],[152,213,182,255]],[[11.102,13.1224],[139,207,185,255]],[[13.1224,15.1429],[126,202,188,255]],[[15.1429,17.1633],[111,196,190,255]],[[17.1633,19.1837],[101,192,192,255]],[[19.1837,21.2041],[89,188,193,255]],[[21.2041,23.2245],[75,184,195,255]],[[23.2245,25.2449],[65,180,196,255]],[[25.2449,27.2653],[63,174,194,255]],[[27.2653,29.2857],[62,168,193,255]],[[29.2857,31.3061],[60,162,192,255]],[[31.3061,33.3265],[59,158,191,255]],[[33.3265,35.3469],[58,156,191,255]],[[35.3469,37.3673],[57,154,190,255]],[[37.3673,39.3878],[56,152,190,255]],[[39.3878,41.4082],[55,149,189,255]],[[41.4082,43.4286],[54,147,189,255]],[[43.4286,45.449],[53,145,188,255]],[[45.449,47.4694],[52,143,188,255]],[[47.4694,49.4898],[51,141,187,255]],[[49.4898,51.5102],[50,138,187,255]],[[51.5102,53.5306],[49,136,186,255]],[[53.5306,55.551],[48,134,186,255]],[[55.551,57.5714],[47,132,185,255]],[[57.5714,59.5918],[46,130,185,255]],[[59.5918,61.6122],[44,127,184,255]],[[61.6122,63.6327],[45,125,183,255]],[[63.6327,65.6531],[45,121,181,255]],[[65.6531,67.6735],[45,118,180,255]],[[67.6735,69.6939],[46,115,178,255]],[[69.6939,71.7143],[46,112,177,255]],[[71.7143,73.7347],[46,108,175,255]],[[73.7347,75.7551],[46,104,173,255]],[[75.7551,77.7755],[46,100,171,255]],[[77.7755,79.7959],[46,96,169,255]],[[79.7959,81.8163],[46,92,167,255]],[[81.8163,83.8367],[46,88,166,255]],[[83.8367,85.8571],[45,84,164,255]],[[85.8571,87.8776],[45,80,162,255]],[[87.8776,89.898],[44,76,160,255]],[[89.898,91.9184],[43,72,158,255]],[[91.9184,93.9388],[42,68,156,255]],[[93.9388,95.9592],[41,64,154,255]],[[95.9592,97.9796],[40,60,152,255]],[[97.9796,100],[38,56,150,255]]]</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <boolProp name="useGroupName">true</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>